<?php require_once('../templates/header.php'); ?>
<div class="container-fluid">
		<div class="content">
				<?php require_once('./includes/etc/header-stats.php');  ?>		
			<div class="row-fluid">
				<div class="span12">
					<div class="alert alert-info alert-block">
						<a href="#" data-dismiss="alert" class="close">×</a>
						<h4 class="alert-heading">Информация!</h4>
						Тук се показват основните промени във всяка една версия на контролния панел.
					</div>				
					<div class="box">
						<div class="box-head">
							<h3>ChangeLog</h3>
						</div>
						<div class="box-content">
							<strong>07.05.2018 г.</strong>
							<ul>
							<li>Премахнат е баланса като функция от контролния панел пради новата политика за безплатна активация на безплатни допълнителни функции.</li>
							<li>Оптимизиран код и бъг фиксове.</li>	
							</ul>						
							<strong>27.02.2018 г.</strong>
							<ul>
							<li>Обновена платформа - reHLDS, reGameDLL.</li>
							<li>Добавени са модулите: ReSRDetector.</li>
							<li>Заменен е модула VoiceDetector с Revoicе който позволява на играчите от Steam и Non-Steam да говорят помежду си.</li>
							<li>Обновени са модулите до последна версия: reAPI, hackdetector, ReAimDetector, WHBlocker, ReSemiclip, Rechecker, ReAuthCheck, Reunion.</li>
							<li>Обновен е изцяло metamod модула с по-съвременна, по-бърза и по-олекотена версия.</li>		
							<li>Фикс на GeoIP+ модула, добавена по-голяма и обновена база GeoIP и GeoIP-City база данни.</li>		
							<li>Добавени са няколко нови правила към защитната стена.</li>		
							<li>Изчистване на ненужно съдържание както и леки промени по кода.</li>		
							</ul>						
							<strong>09.01.2018 г.</strong>
							<ul>
							<li>Обновена платформа - reHLDS, reGameDLL</li>
							<li>Обновени защити както както и добавени няколко нови.</li>
							<li>Добавен модула reAPI което позволява добавянето на различни плъгини които работят именно с този модул</li>		
							</ul>	
							
							<strong>14.06.2017 г.</strong>
							<ul>
							<li>Обновена платформа</li>
							<li>Обновени защити както както и добавени няколко нови.</li>
							<li>Оптимизация по кода и изчистване на дребни бъгове.</li>		
							</ul>							
							<strong>16.02.2017 г.</strong>
							<ul>
							<li>Добавени коректни и съвременни GeoIP.dat и GeoIPCity.dat файлове което позволява работата на плъгини които използвате Geo Location във вашия сървър.</li>
							<li>Добавен мод "Furien v64"</li>
							<li>Оптимизация по кода и изчистване на дребни бъгове.</li>		
							</ul>								
							<strong>15.02.2017 г.</strong>
							<ul>
							<li>Изцяло подменена платформа за всеки един сървър с reHLDS / reGameDLL</li>
							<li>Емулацията на протокол 47/48 вече не се извършва от dProto а чрез reUnion</li>
							<li>Добавени са допълнителни защити както и допълнителни модули с цел по - голяма сигурност и повече функции на вашия сървър.</li>
							<li>amxmodx обновен до 1.8.3. Това би могло да предизвика неправилното функциониране на по - стари плъгини по вашия сървър. Можете да деактивифрате/премахнете такива плъгини от <a href="/plugins" target="_blank">тук</a>. Ако вашия plygin е бил закупен чрез сървър баланс то тогава можете да се свържете с нас и ние ще го променим безплатно.</li>
							<li>Отстранен е проблема свързан с показването на сървъра Ви в steam/master/internet списъка.</li>
							<li>Отстранен е проблема с voice функцията в сървърите</li>
							<li>Всички модове са обновени да поддържат новата платформа. Към този момент модове които съдържат war3ft или "Zombie Base Builder [6.5]" не функционират поради обновлението на amxmodx 1.8.3 . Можете да промените вашия мод от <a href="/mode" target="_blank">тук</a>. Ако вашия мод е бил закупен чрез сървър баланс то тогава можете да се свържете с нас и ние ще го променим безплатно.</li>
							<li>Потребителите с пълен FTP достъп имат запазено копие на предишната платформа в директория cstrike/backup/. Могат да бъдат използвате предишните конфигурационни файлове. Да не се заместват файлове от ядрото на платформата, това със сигурност ще "счупи" вашия сървър. Ако това се случи, можете да използвате опцията за "възвръщане на фабрични настройки".</li>
							<li>Премахната е HLGuard като античиит система тъй като вече не се поддържа от разработчиците и защитите не са актуални. Защитите са вградени в новата платформа.</li>
							<li>Промени по визуалната част на контролния панел</li>
							<li>Оптимизации по кода и отстраняване на дребни бъгове</li>
							</ul>						
							<strong>20.01.2017 г.</strong>
							<ul>
							<li>HLXBans системата е заменена с GM AMXBans версия 1.6. По - новата версия е по - стабилна и по - надеждна.</li>
							<li>Оптимизации по кода</li>
							</ul>						
							<strong>16.01.2017 г.</strong>
							<ul>
							<li>Поддръжка на PHP 5.6</li>
							<li>Изцяло заменена библиотека за отдалечена връзка към сървърите.</li>
							<li>Оптимизации по кода</li>
							</ul>							
							<strong>04.09.2016 г.</strong>
							<ul>
							<li>Обновен код и фикс при активация/деактивация на античиит системите. Вече може да бъдат активирани повече от една античиит система.</li>
							</ul>										
							<strong>31.08.2016 г.</strong>
							<ul>
							<li>Обновена е AMXBans (HLXBans) системата от 6.0.3 на 6.13 и вече включва поддръжка на Non-Steam и не би трябвало да изпитвате проблем с откриването на сървъра при правилно направени настройки.</li>
							<li>Редактирани менюта както и добавена помощна информация.</li>
							</ul>							
							<strong>12.07.2016 г.</strong>
							<ul>
							<li>Опцията за зареждане на сървър баланс е изцяло преправена и напълно активна.</li>
							<li>Оптимизиране на основните функции на контролния панел както и генерални промени по кода.</li>
							<li>Редактирани менюта както и добавена помощна информация.</li>
							</ul>								
							<strong>02.07.2016 г.</strong>
							<ul>
							<li>Заедно с въведените промени по системата на <a href="http://smshosting.bg">smshosting.bg</a> приложихме и промените за безплатни плъгини и модове към всеки един сървър. Вече можете да премахвате плъгини изцяло от системата за да можете да заменяте безплатните плъгини.</li>
							<li>Променени са параметрите на различните планове. Можете да намерите подробна информация за параметрите и цената на всеки план <a href="http://smshosting.bg/counter-strike-servers.html" target="_blank">тук</a></li>
							<li>FPS рейт лимита е вдигнат от 100 на 500 за всеки сървър с изключение на план CS 32 където рейт лимита е 1000 FPS.</li>
							<li>Системата за добавяне на баланс е временно деактивирана поради обновления по кода. Очаквайте скоро повече информация ...</li>
							<li>Подменен е линка за "Помощна информация"</li>
							</ul>			
							<strong>28.03.2016 г.</strong>
							<ul>
							<li>Менюто "Анти-чиит системи" е изцяло препработено. Вече можете да добавяте по повече от една анти-чиит системи като всяка може да бъде активирана/деактивирана според вашите желания.</a></li>
							<li>Добавена е нова анти-чиит система - <strong>Ultimate Jump Anti Cheat 1.4.2 (ujac)</strong></li>
							</ul>						
							<strong>18.02.2016 г.</strong>
							<ul>
							<li>Към всеки сървър е добавен специален метамод модул който автоматично премахва някои специални знаци в съобщенията и имената с цел закриване на дупка в сигурността свързана именно с тези специални символи - SafeNameAndChat</a></li>
							<li>Добавен е метамод модул против най - новия тип WallHack хакове - whblocker</li>
							</ul>							
							<ul>
							<li>Добавена е Сигурна (SSL) връзка до контролния панел на адрес <a href="https://cstrikecp.smshosting.bg">https://cstrikecp.smshosting.bg</a></li>
							<li>Промени по част от функциите така, че повечето от тях да не изискват системен рестарт а обикновен сървър рестарт което предотвратява разкачането на играчи докато правите промени по вашия сървър.</li>
							<li>Поправен линк за "Помощна информация"</li>
							</ul>							
							<strong>21.12.2015 г.</strong>
							<ul>
							<li>Генерални промени по кода на всички скриптове чрез които се контролира сървъра.</li>
							<li>Изцяло преправена опция "Възстановяване на настройки" която сега позволява на вашия сървър да бъде поправен дори и ако не може да стартира при липсващи модели, звуци или други ресурси.</li>
							<li>Подобрен алгоритъм за идентифициране на забил сървър. При следващите промени ще бъде въведена опция за уведомяване чрез мейл при проблем с вашия сървър.</li>
							<li>Подобрени защити като направихме така, че тези защити да са неотлъчна част от всеки един сървър без значение с какъв мод или какви плъгини е сървъра.</li>
							<li>Добавена е опция за възвръщане на фабрични настройки още в самата логин страница така, че дори да се е случило нещо със самия сървър да можете да го поправите.</li>
							<li>Функцията забравена парола вече изпраща нова генерирана парола а не тази която е била до този момент.</li>
							</ul>						
							<strong>23.11.2015 г.</strong>
							<ul>
							<li>Обновена localizebugfix метамод добавка до последна версия.</li>
							<li>Обновена fakedetector метамод добавка до последна версия.</li>
							<li>Подобрен алгоритъм за идентифициране на забил сървър.</li>
							</ul>							
							<strong>31.08.2015 г.</strong>
							<ul>
							<li>Изградена е изцяло нова система със зависимости за изграждане на конфиг файловете с което се избягват проблемите при плъгини които трябва да са на по - горна позиция както и голям брой грешки при наличието на определени плъгини заедно.</li>
							<li>Обновени са <strong>защитите</strong> срещу най - новите експлоити и дупки по кода в платформата на играта.</li>
							<li>Сървър лога не се изчиства вече при системен рестарт а на всеки 24 часа.</li>
							<li>Отстранени бъгове.</li>
							<li>Визуални промени.</li>
							</ul>						
							<strong>31.07.2015 г.</strong>
							<ul>
							<li>Добавени са <strong>нови защити</strong> срещу най - новите експлоити и дупки по кода в платформата на играта.</li>
							<li>Отстранени бъгове</li>
							</ul>							
							<strong>07.07.2015 г.</strong>
							<ul>
							<li><strong>Създадена е опция за поставяне на различни пароли за самия сървър и за контролния панел. Можете да намерите различните опции в категория "Настройки"</strong></li>
							<li>Отстранени бъгове</li>
							</ul>						
							<strong>05.06.2015 г.</strong>
							<ul>
							<li><strong>Обновена dproto версия дo 0.9.548 (stable) която включва множество подобрения и защити.</strong></li>
							</ul>	
							<strong>09.04.2015 г.</strong>
							<ul>
							<li><strong>Добавена нова защита към Metamod "<a href="/antihlbrute">LocalizeBugFix</a>"</strong></li>
							<li>Изцяло променен server.cfg файл с цел подобряване на играта и допълнителна защита.</li>
							<li>Обновено ядро на към всеки физически сървър</li>
							</ul>						
							<strong>17.02.2015 г.</strong>
							<ul>
							<li><strong>Добавена е нова опция "<a href="/antihlbrute">Anti HLBrute система</a>" чрез която можете да блокирате BruteForce атаките за разпознаване на вашата RCON парола към вашият сървър.</strong></li>
							</ul>						
							<strong>04.02.2015 г.</strong>
							<ul>
							<li><strong>Обновена dproto версия дo 0.9.531 (stable) която включва множество подобрения и защити.</strong></li>
							</ul>						
							<strong>24.01.2015 г.</strong>
							<ul>
							<li><strong>Добавена е функция чрез която можете да добавяте ръчно правата на вашите потребители.</strong></li>	
							</ul>						
							<strong>13.01.2015 г.</strong>
							<ul>
							<li><strong>Обновена dproto версия дo 0.9.514 (stable) която включва множество подобрения и защити.</strong></li>	
							<li><strong>Добавен е отделен модул който увеличава лимита за трансфер на данни между сървъра и клиента (nbex) което увеличава производителността на сървърите особено при такива с добавки за прехвърляне на модели, звуци и други файлове.</strong></li>	
							<li><strong>Добавен е отделен модул който премахва излишната информация от userinfo и намалява риска клиента да бъде "изритан" от сървъра с грешката "Reliable channel overflowed"</strong></li>	
							<li><strong>Промени по функциите и генерирането на конфигурационните файлове в контролният панел.</strong></li>	
							</ul>						
							<strong>18.08.2014 г.</strong>
							<ul>
							<li><strong>Версията на сървърите (build) бе обновена до 6153</strong></li>	
							</ul>						
							<strong>13.08.2014 г.</strong>
							<ul>
							<li><strong>dproto версията е обновена до 0.9.391</strong></li>	
							</ul>							
							<strong>08.05.2014 г.</strong>
							<ul>
							<li>Въведена е нова система за <strong>балансиране на натоварването</strong> и предотвратяването на "забили" сървъри.</strong></li>	
							<li><strong>dproto версията е обновена до 0.9.383</strong></li>	
							<li>Поправена е грешката при която някои плъгини липсват при промяна на мода докато тези плъгини са били деактивирани.</li>	
							</ul>						
							<strong>01.04.2014 г.</strong>
							<ul>
							<li><strong>dproto версията е обновена до 0.9.373</strong></li>	
							<li>Поправена е грешката при която част от сървърите не се показват във <strong>favorite списъка</strong> на гейм клиентите.</li>	
							<li>Променени са стойностите за добавяне на баланс към вашият сървър.</li>
							</ul>						
							<strong>02.02.2014 г.</strong>
							<ul>
							<li><strong>Обновена е версията на Файл мениджъра както и поправен бъга в който определени потребители не могат да запаметят редактирани файлове.</strong></li>			
							</ul>							
							<strong>31.01.2014 г.</strong>
							<ul>
							<li><strong>Инсталиран е нов хардуерен сървър (cleveland.novahost.bg) за услугата "Counter-Strike сървър" с цел балансиране на натоварване и допълнителни адреси за сървъри.</strong></li>			
							<li><strong>Оптимизация на сървърите: премахване на излишни конфигурации, обновяване на плъгини, премахване на излишни специални за определен мод плъгини така, че да не зареждат ако мода е различен, но все пак да останат в списъка на потребителя.</strong></li>			
							</ul>						
							<strong>11.12.2013 г.</strong>
							<ul>
							<li><strong>Премахната е опцията за добавяне на сума от 1.20 лв тъй като много скоро ще бъде премахната като поддръжка и от операторите.</strong></li>			
							</ul>							
							<strong>15.11.2013 г.</strong>
							<ul>
							<li><strong>Добавена е функция "GameMenu система" като отделно меню в контролния панел.</strong></li>			
							</ul>						
							<strong>6.11.2013 г.</strong>
							<ul>
							<li><strong>Премахнат е лимита за плъгините от всеки един план за настоящи и бъдещи потребители.</strong></li>			
							<li>Цената на добавките (плъгините) е намалена от 1.20 лв. на 1.00 лв.</li>
							</ul>							
							<strong>4.11.2013 г.</strong>
							<ul>
							<li>Всяко едно добавяне на плъгин/мод/античиит система и т.н. се записва в лога освен като услуга, но и като име за по - лесно разпознаване на покупката.</li>			
							<li>Подобрен изглед при разглеждане на информацията за вашия баланс.</li>								
							<li>Премахнат бутона за премахване на плъгини, за тази цел съществува бутон за паузиране. Напраивхме го с цел предотвратяване на злоупотреби.</li>
							<li>HLXBans функцията вече може да се паузира така, че ако имате някакви проблеми с базата данни просто можете да паузирате функцията вместо да я премахвате и после отново да заплащате за нея.</li>
							<li>Подобрения по интерфейс-а на функцията за античиит системи</li>
							<li>Античиит системата CSF обновена от 1.23 на 1.24c. Всеки може да обнови своята античиит система чрез <strong>зануляване на настройки*</strong></li>
							<li>Обновена dproto версия на 0.9.351 в която има подобрения от към лаг в играта както и много фикснати дупки в сигурността.</li>
							</ul>							
							<strong>16.10.2013 г.</strong>
							<ul>
							<li>Изцяло подменена сървърна платформа от hldsupdatetool (5787) към steampipe (6027)</li>
							<li>Обновен Metamod към специална версия за нашата платформа (1.21.1-am)</li>
							<li>Емулатора за протокол 47+48 обновен до версия 0.9.335</li>
							<li>Обновени модове до amxmodx 1.8.2 както и някои отделни обновления за съвместимост.</li>
							<li>Подобрена игра в сървърите, повишен ФПС рейт.</li>
							</ul>						
							<strong>6.10.2013 г.</strong>
							<ul>
							<li>Основни промени към функцията за изпращане на команда към сървъра и начина на получаване на отговор.</li>
							</ul>
							<strong>3.10.2013 г.</strong>
							<ul>
								<li>Въведен ChangeLog където потребителите могат да следят основните промени.</li>
								<li>Основни промени по изгледа и функционалността на началната страница (начално табло)</li>
								<li>Всеки нов сървър идва с <strong>безплатен FTP достъп</strong>.</li>
								<li>Промени по изгледа на страницата за зареждане на баланс.</li>
								<li>Добавен пряк път за помощна информация към менюто "Основни"</li>
							</ul>
						</div>
					</div>
				</div>
			</div>			
		</div>	
	</div>
<?php require_once('../templates/footer.php'); ?>